nxp-mcuxpresso/mcuxsdk-examples/_boards/rdrw612bga/driver_examples/dmic/dmic_hwvad/pin_mux.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: RW612
package_id: RW612ETA2I
mcu_data: ksdk2_0
processor_version: 0.16.10
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_io_mux.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: E5, peripheral: FLEXCOMM3, signal: USART_RXD, pin_signal: GPIO_24}
  - {pin_num: F6, peripheral: FLEXCOMM3, signal: USART_TXD, pin_signal: GPIO_26}
  - {pin_num: M8, peripheral: DMIC0, signal: 'DATA, 0_1', pin_signal: GPIO_51}
  - {pin_num: L11, peripheral: DMIC0, signal: 'CLK, 0_1', pin_signal: GPIO_53}
  - {pin_num: K8, peripheral: DMIC0, signal: 'DATA, 2_3', pin_signal: GPIO_52}
  - {pin_num: M10, peripheral: DMIC0, signal: 'CLK, 2_3', pin_signal: GPIO_54}
  - {pin_num: N2, peripheral: GPIO, signal: 'PIO0, 1', pin_signal: GPIO_1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : 
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPins(void)
{
    /* Initialize FC3_USART_DATA functionality on pin GPIO_24, GPIO_26 (pin E5_F6) */
    IO_MUX_SetPinMux(IO_MUX_FC3_USART_DATA);
    /* Initialize PDM functionality on pin GPIO_51, GPIO_53, GPIO_52, GPIO_54 (pin M8_L11_K8_M10) */
    IO_MUX_SetPinMux(IO_MUX_PDM);
    /* Initialize GPIO1 functionality on pin GPIO_1 (pin N2) */
    IO_MUX_SetPinMux(IO_MUX_GPIO1);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
